public class Errors {
    private static String[] msgs = {
            "程序不完整",
            "标识符过长",
            "整数过长",
            "缺少右单引号",
            "非法字符常量",
            "文件失败",
            "文件失败",
            "一个非法的字符",
            "符号表溢出",
            "标识符重定义",
            "未定义的标识符",
            "非法的常量值",
            "不是一个合法的标识符名",
            "文件失败",
            "文件失败",
            "分隔符应该为分号或右括号结束",
            "缺少右括号",
            "常量赋值符应该为等号",
            "应该有等号为常量赋值",
            "每个常量之间应该有逗号分隔",
            "常量声明结尾应该有分号",
            "逗号后面必须有一个标识符",
            "文件失败",
            "文件失败",
            "文件失败",
            "文件失败",
            "文件失败",
            "文件失败",
            "非法的变量类型",
            "应该有分号",
            "没有过程名",
            "文件失败",
            "文件失败",
            "文件失败",
            "文件失败",
            "文件失败",
            "过程声明结尾应该有分号",
            "过程不能参与运算",
            "非法的因子",
            "缺少赋值符号",
            "复合语句中每条语句后面应该有分号",
            "缺少end",
            "文件失败",
            "文件失败",
            "文件失败",
            "文件失败",
            "应该有do",
            "缺少左括号",
            "应该是一个标识符",
            "不合法的语句起始符",
            "分程序必须有一个复合语句部分",
            "常量不能被赋值",
            "Read中实参必须是变量",
            "Call中实参必须是分程序",
            "文件失败",
            "文件失败",
            "文件失败",
            "文件失败",
            "程序结尾缺少句号",

    };
    private static int num = 0;

    public static void error(int i) {
        System.out.println("Line "+LexAnalysis.getLine()+":Error" + i + ":" + msgs[i]);
        num++;
    }
    public static int getNum(){
        return num;
    }
}
